#include "stm32f1xx.h"
#include "delay.h"
#include "led.h"
#include "key.h"
#include "iwdg.h"
/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2018-01-01
*
*	版本： 		V1.0
*
*	说明： 		外部中断函数操作实验-HAL库版本
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

int main(void)
{ 
    HAL_Init();                   //初始化HAL库    
    LED_Init();				      //初始化LED	
    KEY_Init();				      //初始化按键
    delay_ms(500);                  //延时500ms再初始化看门狗,LED1的变化"可见"
    IWDG_Init(IWDG_PRESCALER_64,500);  	//分频数为64,重载值为500,溢出时间为1s	
    HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET); 	//LED1对应引脚PB0拉低，亮，
    
	while(1)
	{
        if(KEY_Scan()==S1_PRES)  	//如果S1按下，喂狗
        {
            IWDG_Feed();    			//喂狗
        }
        delay_ms(10); 
        
  }
}
