#include "stm32f1xx.h"
#include "delay.h"
#include "led.h"
#include "key.h"
#include "wwdg.h"


/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2018-01-01
*
*	版本： 		V1.0
*
*	说明： 		按键函数操作实验-HAL库版本
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/


int main(void)
{ 
	unsigned char key = 0;
    
    HAL_Init();             //初始化HAL库    

    LED_Init();				//初始化LED	
    KEY_Init();				//初始化按键
    
    HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET);
    
    delay_ms(500);                  	//延时3500ms再初始化看门狗,LED0的变化"可见"
    WWDG_Init(0X7F,0X5F,WWDG_PRESCALER_8); //计数器值为7F，窗口寄存器为5F，分频数为8

	while(1)
	{
		
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET);
	}
}

